apache/nuttx/arch/mips/include/pic32mx/chip.h
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels */
#  define CHIP_NUSBDMACHAN  2
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NUARTS       2   /* 2 UARTS */
#  define CHIP_UARTFIFOD    8   /* 4 level deep UART FIFOs */
#  define CHIP_NSPI         2   /* 2 SPI interfaces */
#  define CHIP_NI2C         2   /* 2 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX534F064H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 64  /* 64Kb program FLASH */
#  define CHIP_DATAMEM_KB   16  /* 16Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX564F064H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 64  /* 64Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX564F128H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 128 /* 128Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX575F256H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 256 /* 256Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX575F512H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX534F064L)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 64  /* 64Kb program FLASH */
#  define CHIP_DATAMEM_KB   16  /* 16Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX564F064L)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 64  /* 64Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX564F128L)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 128 /* 128Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX575F256L)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 256 /* 256Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX575F512L)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  define CHIP_PIC32MX5     1
#  undef  CHIP_PIC32MX6
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        100 /* Package PT,PF,BG */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  define CHIP_TRACE        1   /* Have trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         4   /* 4 SPI interfaces */
#  define CHIP_NI2C         5   /* 5 I2C interfaces */
#  define CHIP_NCAN         1   /* 1 CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    0   /* No Ethernet */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX664F064H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  define CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 64  /* 64Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX664F128H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  define CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 128 /* 128Kb program FLASH */
#  define CHIP_DATAMEM_KB   32  /* 32Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       4   /* 4 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  define CHIP_VRFSEL       1   /* Have comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX675F256H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  define CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 256 /* 256Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX675F512H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  define CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
#  define CHIP_MHZ          80  /* 80MHz maximum frequency */
#  define CHIP_BOOTFLASH_KB 12  /* 12Kb boot FLASH */
#  define CHIP_PROGFLASH_KB 512 /* 512Kb program FLASH */
#  define CHIP_DATAMEM_KB   64  /* 64Kb data memory */
#  define CHIP_CHE          1   /* Has pre-fetch cache controller */
#  define CHIP_NPORTS       7   /* 7 ports (A, B, C, D, E, F, G) */
#  define CHIP_NTIMERS      5   /* 5 timers */
#  define CHIP_NIC          5   /* 5 input capture */
#  define CHIP_NOC          5   /* 5 output compare */
#  define CHIP_NDMACH       8   /* 8 programmable DMA channels (4 dedicated) */
#  define CHIP_NUSBDMACHAN  tbd
#  undef  CHIP_VRFSEL           /* No comparator voltage reference selection */
#  undef  CHIP_TRACE            /* No trace capability */
#  define CHIP_NUARTS       6   /* 6 UARTS */
#  define CHIP_UARTFIFOD    8   /* 8 level deep UART FIFOs */
#  define CHIP_NSPI         3   /* 3 SPI interfaces */
#  define CHIP_NI2C         4   /* 4 I2C interfaces */
#  define CHIP_NCAN         0   /* No CAN interface */
#  define CHIP_NADC10       16  /* 16 10-bit ADC channels */
#  define CHIP_NCM          2   /* 2 Comparators */
#  define CHIP_PMP          1   /* Have parallel master port */
#  define CHIP_PSP          1   /* Have parallel slave port */
#  define CHIP_NETHERNET    1   /* 1 Ethernet interface */
#  define CHIP_JTAG
#elif defined(CONFIG_ARCH_CHIP_PIC32MX695F512H)
#  undef  CHIP_PIC32MX1
#  undef  CHIP_PIC32MX2
#  undef  CHIP_PIC32MX3
#  undef  CHIP_PIC32MX4
#  undef  CHIP_PIC32MX5
#  define CHIP_PIC32MX6     1
#  undef  CHIP_PIC32MX7
#  define CHIP_NPINS        64  /* Package PT,MR */
